---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.VoltageLossFactor
source: html/a21ac531-1639-37f2-314e-ab11e1e23b1c.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.VoltageLossFactor Property

The voltage loss factor.

## Syntax (C#)
```csharp
public double VoltageLossFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 2.0.